; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v11 ?v5)
             (pred_3 ?v6 ?v9)
             (pred_2 ?v11 ?v9)
             (pred_5 ?v4 ?v11 )
	     (pred_9 ?v11)
             (pred_8 ?v3)
             (pred_1 ?v6)
             (pred_6 ?v9)
             (pred_4 ?v11)
             (pred_11 ?v6)
             (pred_7 ?v11)
             (pred_12 ))



(:action op_2
:parameters (?v1 ?v12 ?v13 ?v7)
:precondition (and (pred_8 ?v1) (pred_8 ?v12) (pred_1 ?v13) (pred_6 ?v7)
          (pred_10 ?v1 ?v12) (pred_3 ?v13 ?v7)
                   (pred_2 ?v12 ?v7) (pred_9 ?v1) 
                   (pred_4 ?v12) (pred_11 ?v13))
:effect (and  (pred_7 ?v12) (not (pred_4 ?v12))))


(:action op_3
:parameters (?v1 ?v2)
:precondition (and (pred_8 ?v1) (pred_8 ?v2)
               (pred_9 ?v1) (pred_10 ?v1 ?v2) (pred_7 ?v2))
:effect (and (pred_9 ?v2) (not (pred_9 ?v1))))

(:action op_5
:parameters (?v1 ?v13)
:precondition (and (pred_8 ?v1) (pred_1 ?v13) 
                  (pred_9 ?v1) (pred_5 ?v13 ?v1) (pred_12 ))
:effect (and (pred_11 ?v13)
   (not (pred_5 ?v13 ?v1)) (not (pred_12 ))))


(:action op_4
:parameters (?v1 ?v8 ?v10)
:precondition (and (pred_8 ?v1) (pred_1 ?v8) (pred_1 ?v10)
                  (pred_9 ?v1) (pred_11 ?v10) (pred_5 ?v8 ?v1))
:effect (and (pred_11 ?v8) (pred_5 ?v10 ?v1)
        (not (pred_11 ?v10)) (not (pred_5 ?v8 ?v1))))

(:action op_1
:parameters (?v1 ?v13)
:precondition (and (pred_8 ?v1) (pred_1 ?v13) 
                  (pred_9 ?v1) (pred_11 ?v13))
:effect (and (pred_12 ) (pred_5 ?v13 ?v1) (not (pred_11 ?v13)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_21 obj_31 obj_16 obj_22 obj_14 obj_17 obj_04 obj_23 obj_06 obj_09 obj_01 obj_18 obj_11 obj_07 obj_29 obj_02 obj_24 obj_12 obj_25 obj_03 obj_15 obj_19 obj_08 obj_20 obj_26
    obj_13 obj_27 obj_05
    obj_30 obj_32 obj_28 obj_10
    )

    (:init
       (pred_12)

       (pred_8 obj_21)
       (pred_8 obj_31)
       (pred_8 obj_16)
       (pred_8 obj_22)
       (pred_8 obj_14)
       (pred_8 obj_17)
       (pred_8 obj_04)
       (pred_8 obj_23)
       (pred_8 obj_06)
       (pred_8 obj_09)
       (pred_8 obj_01)
       (pred_8 obj_18)
       (pred_8 obj_11)
       (pred_8 obj_07)
       (pred_8 obj_29)
       (pred_8 obj_02)
       (pred_8 obj_24)
       (pred_8 obj_12)
       (pred_8 obj_25)
       (pred_8 obj_03)
       (pred_8 obj_15)
       (pred_8 obj_19)
       (pred_8 obj_08)
       (pred_8 obj_20)
       (pred_8 obj_26)
       (pred_6 obj_13)
       (pred_6 obj_27)
       (pred_6 obj_05)
       (pred_1 obj_30)
       (pred_1 obj_32)
       (pred_1 obj_28)
       (pred_1 obj_10)

       (pred_10 obj_21 obj_17)
       (pred_10 obj_21 obj_31)
       (pred_10 obj_31 obj_04)
       (pred_10 obj_31 obj_16)
       (pred_10 obj_31 obj_21)
       (pred_10 obj_16 obj_23)
       (pred_10 obj_16 obj_22)
       (pred_10 obj_16 obj_31)
       (pred_10 obj_22 obj_06)
       (pred_10 obj_22 obj_14)
       (pred_10 obj_22 obj_16)
       (pred_10 obj_14 obj_09)
       (pred_10 obj_14 obj_22)
       (pred_10 obj_17 obj_01)
       (pred_10 obj_17 obj_04)
       (pred_10 obj_17 obj_21)
       (pred_10 obj_04 obj_18)
       (pred_10 obj_04 obj_23)
       (pred_10 obj_04 obj_31)
       (pred_10 obj_04 obj_17)
       (pred_10 obj_23 obj_11)
       (pred_10 obj_23 obj_06)
       (pred_10 obj_23 obj_16)
       (pred_10 obj_23 obj_04)
       (pred_10 obj_06 obj_07)
       (pred_10 obj_06 obj_09)
       (pred_10 obj_06 obj_22)
       (pred_10 obj_06 obj_23)
       (pred_10 obj_09 obj_29)
       (pred_10 obj_09 obj_14)
       (pred_10 obj_09 obj_06)
       (pred_10 obj_01 obj_02)
       (pred_10 obj_01 obj_18)
       (pred_10 obj_01 obj_17)
       (pred_10 obj_18 obj_24)
       (pred_10 obj_18 obj_11)
       (pred_10 obj_18 obj_04)
       (pred_10 obj_18 obj_01)
       (pred_10 obj_11 obj_12)
       (pred_10 obj_11 obj_07)
       (pred_10 obj_11 obj_23)
       (pred_10 obj_11 obj_18)
       (pred_10 obj_07 obj_25)
       (pred_10 obj_07 obj_29)
       (pred_10 obj_07 obj_06)
       (pred_10 obj_07 obj_11)
       (pred_10 obj_29 obj_03)
       (pred_10 obj_29 obj_09)
       (pred_10 obj_29 obj_07)
       (pred_10 obj_02 obj_15)
       (pred_10 obj_02 obj_24)
       (pred_10 obj_02 obj_01)
       (pred_10 obj_24 obj_19)
       (pred_10 obj_24 obj_12)
       (pred_10 obj_24 obj_18)
       (pred_10 obj_24 obj_02)
       (pred_10 obj_12 obj_08)
       (pred_10 obj_12 obj_25)
       (pred_10 obj_12 obj_11)
       (pred_10 obj_12 obj_24)
       (pred_10 obj_25 obj_20)
       (pred_10 obj_25 obj_03)
       (pred_10 obj_25 obj_07)
       (pred_10 obj_25 obj_12)
       (pred_10 obj_03 obj_26)
       (pred_10 obj_03 obj_29)
       (pred_10 obj_03 obj_25)
       (pred_10 obj_15 obj_19)
       (pred_10 obj_15 obj_02)
       (pred_10 obj_19 obj_08)
       (pred_10 obj_19 obj_24)
       (pred_10 obj_19 obj_15)
       (pred_10 obj_08 obj_20)
       (pred_10 obj_08 obj_12)
       (pred_10 obj_08 obj_19)
       (pred_10 obj_20 obj_26)
       (pred_10 obj_20 obj_25)
       (pred_10 obj_20 obj_08)
       (pred_10 obj_26 obj_03)
       (pred_10 obj_26 obj_20)
       (pred_4 obj_23)
       (pred_4 obj_11)
       (pred_4 obj_19)
       (pred_4 obj_12)
       (pred_2  obj_23 obj_13)
       (pred_2  obj_11 obj_27)
       (pred_2  obj_19 obj_05)
       (pred_2  obj_12 obj_13)
       (pred_7 obj_21)
       (pred_7 obj_31)
       (pred_7 obj_16)
       (pred_7 obj_22)
       (pred_7 obj_14)
       (pred_7 obj_17)
       (pred_7 obj_04)
       (pred_7 obj_06)
       (pred_7 obj_09)
       (pred_7 obj_01)
       (pred_7 obj_18)
       (pred_7 obj_07)
       (pred_7 obj_29)
       (pred_7 obj_02)
       (pred_7 obj_24)
       (pred_7 obj_25)
       (pred_7 obj_03)
       (pred_7 obj_15)
       (pred_7 obj_08)
       (pred_7 obj_20)
       (pred_7 obj_26)

       (pred_3  obj_30 obj_13)
       (pred_3  obj_32 obj_27)
       (pred_3  obj_28 obj_05)
       (pred_3  obj_10 obj_27)
       (pred_5 obj_30 obj_17)
       (pred_5 obj_32 obj_20)
       (pred_5 obj_28 obj_15)
       (pred_5 obj_10 obj_03)
       (pred_9 obj_16)
    )

    (:goal (and
       (pred_5 obj_32 obj_09)
    ))
(:constraints
  (always (not (pred_9 obj_25)))
)
)

; plan
1. (op_3 obj_16 obj_22)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_22)
   goals met: 0 of 1
2. (op_3 obj_22 obj_06)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_06)
   goals met: 0 of 1
3. (op_3 obj_06 obj_07)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_07)
   goals met: 0 of 1
4. (op_3 obj_07 obj_29)
   deleted: (pred_9 obj_07)
   added: (pred_9 obj_29)
   goals met: 0 of 1
5. (op_3 obj_29 obj_03)
   deleted: (pred_9 obj_29)
   added: (pred_9 obj_03)
   goals met: 0 of 1
6. (op_3 obj_03 obj_26)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_26)
   goals met: 0 of 1
7. (op_3 obj_26 obj_20)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_20)
   goals met: 0 of 1
8. (op_5 obj_20 obj_32)
   deleted: (pred_5 obj_32 obj_20) (pred_12)
   added: (pred_11 obj_32)
   goals met: 0 of 1
9. (op_3 obj_20 obj_26)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_26)
   goals met: 0 of 1
10. (op_3 obj_26 obj_03)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_03)
   goals met: 0 of 1
11. (op_3 obj_03 obj_29)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_29)
   goals met: 0 of 1
12. (op_3 obj_29 obj_09)
   deleted: (pred_9 obj_29)
   added: (pred_9 obj_09)
   goals met: 0 of 1
13. (op_1 obj_09 obj_32)
   deleted: (pred_11 obj_32)
   added: (pred_12) (pred_5 obj_32 obj_09)
   goals met: 1 of 1
